# CSS基础

1、css样式文件要放单独放在一个文件夹中，JavaScript脚本文件也是一样，这样便于管理和维护。不管网页文件大还是小，注意细节！

2、在写CSS样式的时候，首先应将标签的默认样式重置。

3、text-align：center; 无效的原因：text-align是有应用场景的，其只应用于块级元素、单元格（table-cell）元素、行内块元素。给一个内联元素添加text-align：center；是没有作用的。

4、同样的，vertical-align在使用中也有条件限制，其使用条件是行内元素（内联元素）、单元格（table-cell）元素。经过测试单元格（table-cell）元素使用vertical-align可实现居中问题；行内元素使用vertical-align会改变基线的位置。见下面的例子，左图未给img加vertical-align属性，右图给img添加了vertical-align属性，可发现文字相对图片的位置发生了变化。

5、html中的role属性：HTML5的标签属性，用于标识一个普通标签，增强其语义性，方便浏览器对具体功能进行识别。通常这种情况出现在一些自定义的组件上，这样可增强组件的可访问性、可用性和可交互性。例如div容器制作的导航栏，加上role="navigation"，就可以让浏览器知晓这是一个导航容器而不是一个普通的容器，当然，针对题目中的这种用法，其实用&lt;nav&gt;标签会更好。

6、类似与下面这种局部页面有两种实现方法。同一行上两个标签，左边的标签浮动，文字右对齐；第二种不浮动，左边标签加上display：inline-block，再右对齐。

7、给li元素添加display属性的时候，li元素默认的list-style就会消失，这是因li元素默认的display：list-item，将li元素的display属性改为其他值，就表示这个标签不再是原来的li元素了，如果要想实现在同一行显示，而又不想影响li的符号，最好的做法是设置float属性。

8、改变li元素默认显示点的颜色的方法，在ul元素上加上color属性，在li元素上加上另外一种color值，就会发现li元素默认点的颜色和li内容的颜色不同，这样色彩的变换可能会提升用户的体验。